mapping inquiry_msg = ([
	       	"强盗" : 	"镇外有强盗，镇内也有强盗，这日子可怎么过下去呀！\n",
	       	"bandit" : 	"镇外有强盗，镇内也有强盗，这日子可怎么过下去呀！\n",
             	"镇外的强盗" : 	"还不就是龙虎寨的那些山贼么！\n",
             	"镇内的强盗" : 	"不能说，不能说呀。。\n",
             	"张老实":	"张老实是镇上小面馆的老板。\n",
             	"宋富贵":	"宋富贵是镇上棉花行的老板。\n",
             	"李马虎":	"李马虎是镇上杂货铺的老板。\n",
             	"陈大倌":	"陈大倌是镇上绸缎庄的老板。\n",
             	"胖子":		"陈大倌是镇上一品香的老板。\n",
             	"丁老四":	"丁老四是镇上小饭馆的老板。\n",
             	"萧别离":	"萧别离是镇上相聚楼的老板。\n",
             	"翠浓":		"翠浓是镇上销金窟的红角儿。\n",
             	"胡歪瓜":	"胡歪瓜是镇上的地头蛇，据说手下有两下子，没事儿你还是躲远点好。\n",
             	"万马堂":	"三堂主是万马堂的大当家。\n",
             	"马空群":	"三堂主是万马堂的大当家。\n",
             	"花满天":	"花满天是万马堂的二当家。\n",
             	"云在天":	"云在天是万马堂的三当家。\n",
]);


string query_inquiry_msg(string arg) {
	string *msg;
	int i;	
	msg=keys(inquiry_msg);
	for (i=0;i<sizeof(msg);i++) 
		if (msg[i]==arg) return inquiry_msg[msg[i]];
	return 0;
}	