// 本文件被两个文件调用
// 分别是同目录的  obj_copy.h
// 以及上级目录的 幻境结束游戏时的统计成绩 的房间文件


/******************************************************************************
 价格定制经严格测试，请勿随意更改； 及，各物品之效能等亦有关联，亦勿随意更改。
各物品价格如下：

<奇特>类

定向水晶 10  飞翔之石 20  脱离水晶 50  回归之镜 10
祈祷之石 50  召唤之盒 20  发呆之旗 50  驱逐之旗 88
寻人水晶 10  窥探水晶 10  定位之仪 30

<果品类>

无名果 1  仙人果 5  淘气果 3  毒龙果 5  野生果实 1
试炼之果 30

<兵器类>

青铜之剑 10  灵气之剑 20  白银之剑 15  盈动之剑 20
黄金之剑 20  耐力之剑 30  迅隐之剑 50  夺魂之剑 30  必胜之剑 50
狂风水晶 20  暴雨水晶 20  落雷水晶 20  引电水晶 20
滚石水晶 10  飞火水晶 10  夺魂水晶 30

<神秘>类

呼风之石 20  唤雨之石 20  落雷之石 20  引电之石 20
滚石之石 10  飞火之石 10  夺魂之石 30  复活之石 50

********************************************************************************/

mapping all_values=([
"dx":10,"fx":20,"tl":50,"hg":10,
"qd":50,"zh":20,"fd":50,"qz":88,
"xr":10,"kt":10,"dw":30,

"wmg":1,"xrg":5,"tqg":3,"dlg":5,"ysg":1,
"slg":30,

"qtj":10,"lqj":20,"byj":15,"ydj":20,
"hjj":20,"nlj":30,"xyj":50,"dhj":30,"bsj":50,
"kfsj":20,"bysj":20,"llsj":20,"ydsj":20,
"gssj":10,"fhsj":10,"dhsj":30,

"hfzs":20,"hyzs":20,"llzs":20,"ydzs":20,
"gszs":10,"fhs":10,"dhzs":30,"fhzs":50

    ]);


